# GetResources Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalResourceBrowserData..::..GetResources Method
ExternalResourceBrowserData Class See Also
---
Gets the external resources under the folder path of the browser data.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public IList<ExternalResourceReference> GetResources()
```

Visual Basic
---
```text
Public Function GetResources As IList(Of ExternalResourceReference)
```

Visual C++
---
```text
public:
IList<ExternalResourceReference^>^ GetResources()
```

# ### Return Value
The external resources under current folder of the browser data.
# See Also
ExternalResourceBrowserData Class
Autodesk.Revit.DB Namespace